{
  "_attn_implementation_autoset": true,
  "_name_or_path": "./RoLlama2-7b-Instruct/",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_dropped_llama.LlamaConfig",
    "AutoModelForCausalLM": "modeling_dropped_llama.LlamaForCausalLM"
  },
  "bos_token_id": 1,
  "drop_attn_list": [],
  "drop_mlp_list": [
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28
  ],
  "eos_token_id": 2,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 4096,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.0",
  "use_cache": false,
  "vocab_size": 32000
}
